; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-7)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(free left)
(free right)
(at ball1 rooma)
(at ball2 roomb)
(at ball3 room3)
(at ball4 room4)
(at ball5 room5)
(at ball6 room5)
(at ball7 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 room4)
(at ball6 room6)
(at ball7 room6)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 3 of 7
2. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 3 of 7
3. (pick ball6 room5 left)
   deleted: (at ball6 room5) (free left)
   added: (carry ball6 left)
   goals met: 3 of 7
4. (pick ball5 room5 right)
   deleted: (at ball5 room5) (free right)
   added: (carry ball5 right)
   goals met: 3 of 7
5. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 3 of 7
6. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 3 of 7
7. (drop ball6 room6 left)
   deleted: (carry ball6 left)
   added: (at ball6 room6) (free left)
   goals met: 4 of 7
8. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 4 of 7
9. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 4 of 7
10. (drop ball5 room4 right)
   deleted: (carry ball5 right)
   added: (at ball5 room4) (free right)
   goals met: 5 of 7
11. (pick ball4 room4 left)
   deleted: (at ball4 room4) (free left)
   added: (carry ball4 left)
   goals met: 5 of 7
12. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 5 of 7
13. (drop ball4 roomb left)
   deleted: (carry ball4 left)
   added: (at ball4 roomb) (free left)
   goals met: 6 of 7
14. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 6 of 7
15. (pick ball3 room3 left)
   deleted: (at ball3 room3) (free left)
   added: (carry ball3 left)
   goals met: 6 of 7
16. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 6 of 7
17. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at ball3 roomb) (free left)
   goals met: 7 of 7
